In [1]:
import pandas as pd
dict={'Name':['King','Queen','Pricess','Prince','Diana','William','Georg'],
      'Marks':[90,89,80,88,90,98,88],
      'Grades':['AA','AB','CC','BB','AA','AA','BB']}
df=pd.DataFrame(dict,index=['stu1','stu2','stu3','stu4','stu5','stu6','stu7'])
df

         Name  Marks Grades
stu1     King     90     AA
stu2    Queen     89     AB
stu3  Pricess     80     CC
stu4   Prince     88     BB
stu5    Diana     90     AA
stu6  William     98     AA
stu7    Georg     88     BB

In [2]:
# Boolean array size must be the same as your DataFrame Size.
# This concept is very important in filtering the data frame
# Boolean list with the same length as the row axis
# df.loc[row(s),column(s)]
df.loc[[False,False,False,False,False,False,False]]

Empty DataFrame
Columns: [Name, Marks, Grades]
Index: []

In [3]:
df.shape

(7, 3)

In [4]:
df.loc[[True,False,False,False,False,False,False]]

      Name  Marks Grades
stu1  King     90     AA

In [5]:
# Boolean array size must be the same as your DataFrame Size.
# Boolean list with the same length as the row axis & column axis
# df.loc[row(s),column(s)]
df.loc[[False,False,False,False,False,False,False],[False,False,False]]

Empty DataFrame
Columns: []
Index: []

In [ ]:
# Print Name of stu1 and stu2

In [8]:
df.loc[[True,True,False,False,False,False,False],[True,False,False]]

       Name
stu1   King
stu2  Queen

In [10]:
#Print Grades of stu1 and stu5
df.loc[[True,False,False,False,True,False,False],[False,False,True]]

     Grades
stu1     AA
stu5     AA

In [11]:
# Print Marks of stu4
df.loc[[False,False,False,True,False,False,False],[False,True,False]]

      Marks
stu4     88